#include <beep.h>

sbit beep=P1^5;	//蜂鸣器引脚的定义

u16 code CT[]={0,
262,294,330,349,392,440,494,
523,587,659,698,784,880,988,
1046,1175,1318,1397,1568,1760,1976
};//“哆、瑞、咪、发、嗦、啦、西”低、中、高音对应的频率。
//低音频率对应数组下标为1-7
//中音频率对应数组下标为(1-7)+7
//高音频率对应数组下标为(1-7)+14

void beep_on(u16 n,u16 f)//蜂鸣器响：频率f，单位Hz；声音持续时长n，单位毫秒
{
	u16 t,i,c;
	//根据频率计算一个脉冲周期内电平持续时间(微妙)，t=1000000/(2*f)/10，继续除10是因为微秒延时函数是10倍x微妙
	t=50000/f;
	//根据声音持续时长，计算脉冲周期重复次数，c=f*n/1000
	c=(u32)f*n/1000;  //因为f*n会超过u16表示范围，所以需要进行强制类型转换，防止出现溢出

	for(i=0;i<c;i++)//循环c次，使声音持续n毫秒
	{
		beep=1;  //输出高电平
		delay_10xus(t);  //延时10*t微妙
		beep=0;  //输出低电平
		delay_10xus(t);  //延时10*t微妙
	}
}

void alarm()//蜂鸣器发出2种不同频率的声音，即：报警声
{
	beep_on(500,500);//蜂鸣器响：频率500Hz，持续500毫秒		
	beep_on(500,1000);//蜂鸣器响：频率1000Hz，持续500毫秒 
}

void playmusic(u8 *Meter,u8 *TONE,u8 n)//播放歌曲，*Meter指向歌曲的节拍数组，*TONE指向歌曲的音调数组，n为歌曲中音调的个数
{
    u8 i;    
	for(i=0;i<n;i++)//歌曲有n个音
  		beep_on(Meter[i]*250,CT[TONE[i]]);//蜂鸣器依次播放对应的音调，持续时长为对应的节拍，这里取1拍为250毫秒
		
}


