//本代码基于stc89c52，串口通信时需要使用定时器T1设置波特率，因此使用使用定时器T0来产生1ms的定时
#include "timer.h"
void timer0_init()//定时器T0定时1毫秒@12.000MHz
{
	TMOD&= 0xF0;
	TMOD|= 0x01;	//设置定时器T0工作模式：软启动、定时、工作方式1-16位计数值
	TL0 = 0x18;		//设置定时初值，定时1ms
	TH0 = 0xFC;		
	TF0 = 0;		//清除TF0标志
	TR0 = 1;		//定时器0开始计时
	ET0=1;			//允许定时器0中断
	EA=1;			//开中断 
}

void timer1_init()//定时器1定时模式计时@12.000MHz，用于超声波测距
{
	TMOD &= 0x0F;
	TMOD |= 0x10;	//设置定时器T1工作模式：软启动、定时、工作方式1-16位计数值
	TL1 = 0x00;//设置定时器0初值
	TH1 = 0x00;
	TF1 = 0;//清除定时器0中断标记TF0
	ET1 = 0;//禁止定时器0中断
	TR1 = 0;//定时器0停止定时
}