#include "uart.h"

void uart_init()//4800bps@12MHz，选择定时器1为波特率发生器
{
	SCON&=0x0f;
	SCON|=0x50;//双机通信，工作方式1：8位异步收发、波特率可变，允许接收数据
	PCON |= 0x80;		//使能波特率倍速位SMOD
	TMOD &= 0x0F;		//清除定时器1模式位
	TMOD |= 0x20;		//设定定时器1为8位自动重装方式
	TL1 = 0xF3;		//设定定时初值
	TH1 = 0xF3;		//设定定时器重装值
	ET1 = 0;		//禁止定时器1中断
	TR1 = 1;		//启动定时器1
	TI=0;//软件清零，表示未发送完成
	ES = 1;//允许串口中断
	EA = 1;//开中断
}
void uart_sendstr(u8 *str)//输出字符串到串口
{
	ES=0;//关串口中断
	TI=1;//置位发送中断标记，启动发送
	printf("%s\n",str);//发送
	while(!TI);//等待发送完成
	TI=0;//发送结束，清除发送中断标记
	ES=1;//开串口中断
}